spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_the_webhook_from_stripe_for_charge_succeeded.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_15FATvCf2xtNtL5JRIUGEHrI
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_pOCsio4MEdXiZLZTdTMtMMvg
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.1 p76 (2014-02-24)","platform":"x86_64-darwin12.0","publisher":"stripe","uname":"Darwin
        Coreys-Macbook-Pro-2.local 14.0.0 Darwin Kernel Version 14.0.0: Fri Sep 19
        00:26:44 PDT 2014; root:xnu-2782.1.97~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 29 Dec 2014 21:10:08 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1892'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_yyXXntCp37XEDq5z
      Stripe-Version:
      - '2014-12-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_15FATvCf2xtNtL5JRIUGEHrI",
          "created": 1419886275,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_15FATvCf2xtNtL5JbTq6XW0n",
              "object": "charge",
              "created": 1419886275,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "captured": true,
              "card": {
                "id": "card_15FATuCf2xtNtL5JGiB7X5q5",
                "object": "card",
                "last4": "4242",
                "brand": "Visa",
                "funding": "credit",
                "exp_month": 12,
                "exp_year": 2015,
                "fingerprint": "ZUV43zFRO2RbtMVO",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": null,
                "address_line1_check": null,
                "address_zip_check": null,
                "dynamic_last4": null,
                "customer": "cus_5Q0UowtO7vYNpV"
              },
              "balance_transaction": "txn_15FATvCf2xtNtL5JETrzIcn6",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_5Q0UowtO7vYNpV",
              "invoice": "in_15FATvCf2xtNtL5JURGGuWfA",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_descriptor": "Myflix BASE PLAN",
              "fraud_details": {},
              "receipt_email": null,
              "receipt_number": null,
              "shipping": null,
              "refunds": {
                "object": "list",
                "total_count": 0,
                "has_more": false,
                "url": "/v1/charges/ch_15FATvCf2xtNtL5JbTq6XW0n/refunds",
                "data": []
              },
              "statement_description": "Myflix BASE PLAN"
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_5Q0U8gEG0350wE",
          "api_version": "2014-12-08"
        }
    http_version: 
  recorded_at: Mon, 29 Dec 2014 21:10:08 GMT
recorded_with: VCR 2.9.3
